Tekla Open API Reference for Tekla Structures 2025
Detail.GetReferencePoint Method
 Returns the reference point.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point GetReferencePoint()
Public Function GetReferencePoint As Point
Return Value
Type: Point
The reference point.
See Also
Reference
Detail Class
Tekla.Structures.Model Namespace